/*
vector 底层实现原理：

1.一句话，底层实现了一个动态数组
2.vector类构成，继承
-class vector : protected _Vector_base<_Tp, _Alloc>
基类的public继承会变成protected，其他权限不会改变

3.Vector_base有哪些重要属性
	pointer _M_start;------容器开始的位置
	pointer _M_finish;------容器结束的位置
	pointer _M_end_of_storage;------动态分配内存的最后一个位置。

4.构造函数：
-1.无参构造函数：vector不会申请任何动态内存空间，只有插入才会分配内容，性能优先。
-2.初始化元素个数的构造：-一次性申请足够的动态内存。
                       -避免我们多次申请动态内存，影响性能

5.插入元素：分为俩种情况
-1.插入到最后：检查空间是否需要动态分配内存，是否需要翻倍，直接插入到最后finish后。
-2.插入不是最后：-检查空间，是否需要动态分配内存，是否需要翻倍。
              -待插入位置之后的元素往后平移一位，然后插入元素。

6.删除元素：分为俩种情况
-1.删除最后：只需要把_M_finish指针往前移动一位,删除元素不会释放现有已经申请的内存。
-2.删除不是最后：待删元素后所有的元素往前移动一位，也不会释放现有已经申请的内存。

7.读取元素
{
-1.操作符[]：会越界
-2.at()函数:比操作符多了一个检查越界操作，越界会返回null
}上面俩个都是返回具体元素的引用，修改引用可以修改元素

8.修改元素
-1.vector不支持直接修改某个位置的元素，只能通过读取元素获取引用，然后修改引用
-2.先删除，在插入

9.释放空间
问题：1.怎么确保vector里面是空的，也就是0？
      2.怎么不在析构提前释放空间？
-1.swap 一个空容器
-2.C++11 shrink_to_fit()函数，释放掉未使用的内存，
        -本质就是把_M_end_of_storage指针移动到_M_finish指针位置，释放掉未使用的内存。

注：
1.调用clear清空所有内容，但不会释放空间
    -在调用shrink_to_fit()函数后，释放掉全部的内存

2.空间是翻倍
   -如：1 2 4 8 16 32 64 128
   -插入第二个元素申请俩个空间，插入第三元素申请四个空间

*/

#include<vector>
using namespace std;
int main(){
    vector<int> vec;

    return 0;
}